toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        // Schedule the MotionDisable event, if applicable
        // This needs to happen before we reschedule `motionEnableEvent` because we need its .time to
        // properly schedule the MotionDisableEvent!
        const uint32_t durationTicks = trigger.base().durationTicks;
        if (durationTicks) {
            EventInsert((_Triggers::MotionDisableEvent&)trigger, ev.time, durationTicks);
        }
        
        // Reschedule MotionEnableEvent for its next trigger time
        EventInsert(ev, ev.repeat);
    }
    
    static void _MotionDisable(_Triggers::MotionDisableEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.set(false);
    }
    
    static void _MotionUnsuppress(_Triggers::MotionUnsuppressEvent& ev) {
        // We should never get a MotionUnsuppressEvent event while in fast-forward mode
        Assert(!_State.fastForward);
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.suppress(false);
    }
    
    static void _CaptureImage(_Triggers::CaptureImageEvent& ev) {
        // We should never get a CaptureImageEvent event while in fast-forward mode
        Assert(!_State.fastForward);
        
        constexpr MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        const bool green = ev.capture->leds & MSP::LEDs_::Green;
        const bool red = ev.capture->leds & MSP::LEDs_::Red;
        _LEDGreen_.set(_LEDPriority::Capture, !green);
        _LEDRed_.set(_LEDPriority::Capture, !red);
        
        // Turn on VDD_B power (turns on ICE40)
        _State.vddb = true;
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms<30>);
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _State.vddImgSd = true;
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait until _TaskSD has initialized _State.sd (since we're about to refer to
            // _State.sd.imgRingBufs), and for any previous writing to be complete (because
            // the SDRAM is single-port, so we can't write an image to RAM until we're done
            // copying an image from RAM -> SD card).
            _Scheduler::Wait([] { return _TaskSD::SDStateReady() && !_TaskSD::Writing(); });
            
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
            
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
        _LEDGreen_.set(_LEDPriority::Capture, std::nullopt);
        _LEDRed_.set(_LEDPriority::Capture, std::nullopt);
        
        _State.vddImgSd = false;
        _State.vddb = false;
        
        ev.countRem--;
        if (ev.countRem) {
            EventInsert(ev, ev.time, ev.capture->delayTicks);
        }
    }
    
    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time) {
//        _Debug::Print("EventInsert DDD");
        _Triggers::EventInsert(ev, time);
        // If this event is now the front of the list, reschedule _EventTimer
        if (_Triggers::EventFront() == &ev) {
//            _Debug::Print("EventInsert EEE");
            _EventTimerSchedule();
        }
    }

    static void EventInsert(_Triggers::Event& ev, MSP::Repeat& repeat) {
//        _Debug::Print("EventInsert BBB");
        const Time::Ticks32 delta = _RepeatAdvance(repeat);
//        _Debug::PrintHex(delta);
        // delta=0 means Repeat=never, in which case we don't reschedule the event
        if (delta) {
//            _Debug::Print("EventInsert CCC");
            EventInsert(ev, ev.time+delta);
        }
    }

    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time, Time::Ticks32 deltaTicks) {
//        _Debug::Print("EventInsert AAA");
        EventInsert(ev, time + deltaTicks);
    }

    static void CaptureStart(_Triggers::CaptureImageEvent& ev, const Time::Instant& time) {
        // Reset capture count
        ev.countRem = ev.capture->count;
        if (ev.countRem) {
            EventInsert(ev, time);
        }
    }
    
    static void _EventTimerSchedule() {
        _Triggers::Event* ev = _Triggers::EventFront();
        if (ev) {
            _EventTimer::Schedule(ev->time);
        } else {
            _EventTimer::Reset();
        }
    }
    
    // _EventPop(): pops an event from the front of the list if it's ready to be handled
    // Interrupts must be disabled
    static _Triggers::Event& _EventPop() {
        _Triggers::Event* ev = _Triggers::EventFront();
        Assert(ev); // We must have an event at this point, or else we have a logic error
        _Triggers::EventPop();
        // Schedule _EventTimer for the next event
        _EventTimerSchedule();
        return *ev;
    }
    
    static bool _EventTimerFired() {
        const bool fired = _EventTimer::Fired();
        // Exit fast-forward mode the first time we have an event that's in the future
        if (!fired) _State.fastForward = false;
        return fired;
    }
    
    static void Run() {
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        // Init Triggers
        _Triggers::Init(_RTC::Now());
        
        // Schedule _EventTimer for the first event
        _EventTimerSchedule();
        
        // Enter fast-forward mode while we pop every event that occurs in the past
        // (_EventTimerFired() will exit from fast-forward mode)
        #warning TODO: don't enter fast-forward mode if the first event is a relative time, otherwise we'll arbitrarily skip the first event in FF mode since it's in the past
        #warning TODO: OR: don't enter FF mode if our time is a relative time
        _State.fastForward = true;
        for (;;) {
            // Wait for _EventTimer to fire
            _Scheduler::Wait([] { return _EventTimerFired(); });
            _Triggers::Event& ev = _EventPop();
            
            // Don't go to sleep until we handle the event
            _State.caffeine = true;
            
            // Handle the event
            using T = _Triggers::Event::Type;
            switch (ev.type) {
            case T::TimeTrigger:      _TimeTrigger((_Triggers::TimeTriggerEvent&)ev);           break;
            case T::MotionEnable:     _MotionEnable((_Triggers::MotionEnableEvent&)ev);         break;
            case T::MotionDisable:    _MotionDisable((_Triggers::MotionDisableEvent&)ev);       break;
            case T::MotionUnsuppress: _MotionUnsuppress((_Triggers::MotionUnsuppressEvent&)ev); break;
            case T::CaptureImage:     _CaptureImage((_Triggers::CaptureImageEvent&)ev);         break;
            }
            
            // Allow sleep
            _State.caffeine = false;
        }
    }
    
