toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    SchedulerStack(".stack._TaskMotion")
    static inline uint8_t Stack[128];
};

static void _MotionEnabledUpdate() {
    _Motion::Enabled(_MotionEnabled::Asserted());
}

// MARK: - _TaskMain

#define _TaskMainStackSize 128

SchedulerStack(".stack._TaskMain")
uint8_t _TaskMainStack[_TaskMainStackSize];

asm(".global _StartupStack");
asm(".equ _StartupStack, _TaskMainStack+" Stringify(_TaskMainStackSize));

// _OnSaved: remembers our power state across crashes and LPM3.5.
// This is needed because we don't want the device to return to the
// powered-off state after a crash.
//
// Stored in BAKMEM so it's kept alive through low-power modes <= LPM4.
//
// Apparently it has to be stored outside of _TaskMain for the gnu::section
// attribute to work.
[[gnu::section(".ram_backup_bss._TaskMain")]]
static inline bool _OnSaved = false;

struct _TaskMain {
    static void _Init() {
        // Disable interrupts while we init our subsystems
        Toastbox::IntState ints(false);
        
        // Init watchdog first
        _Watchdog::Init();
        
        // Init GPIOs
        GPIO::Init<
            // Power control
            _Pin::VDD_B_EN,
            _Pin::VDD_B_1V8_IMG_SD_EN,
            _Pin::VDD_B_2V8_IMG_SD_EN,
            
            // Clock (config chosen by _Clock)
            _Clock::Pin::XIN,
            _Clock::Pin::XOUT,
            
            // SPI (config chosen by _SPI)
            _SPI::Pin::Clk,
            _SPI::Pin::DataOut,
            _SPI::Pin::DataIn,
            
            // I2C (config chosen by _I2C)
            _I2C::Pin::SCL,
            _I2C::Pin::SDA,
            _I2C::Pin::Active,
            
            // Motion (config chosen by _Motion)
            _Motion::Pin::Power,
            _Motion::Pin::Signal,
            
            // Battery (config chosen by _BatterySampler)
            _BatterySampler::Pin::BatChrgLvlPin,
            _BatterySampler::Pin::BatChrgLvlEn_Pin,
            
            // Button (config chosen by _Button)
            _Button::Pin,
            
            // LEDs
            _Pin::LED_GREEN_,
            _Pin::LED_RED_
        >();
        
        // Init clock
        _Clock::Init();
        
//        _Pin::LED_RED_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//            _Pin::LED_RED_::Write(1);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//        }
        
        // Init RTC
        // We need RTC to be unconditionally enabled for 2 reasons:
        //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
        //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
        //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
        _RTC::Init();
        
        // Init BatterySampler
        _BatterySampler::Init();
        
        // Init LEDs by setting their default-priority / 'backstop' values to off.
        // This is necessary so that relinquishing the LEDs from I2C task causes
        // them to turn off. If we didn't have a backstop value, the LEDs would
        // remain in whatever state the I2C task set them to before relinquishing.
        _LEDGreen_.set(_LEDPriority::Default, 1);
        _LEDRed_.set(_LEDPriority::Default, 1);
        
        // Start tasks
        _Scheduler::Start<_TaskI2C, _TaskMotion>();
        
        // Restore our saved power state
        // _OnSaved stores our power state across crashes/LPM3.5, so we need to
        // restore our _On assertion based on it.
        if (_OnSaved) {
            _On = true;
        }
    }
    
    static void Run() {
        _Init();
        
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//        }
        
//        for (bool on_=0;; on_=!on_) {
//            _Debug::Print("hello\nhow are you today?\n");
//            _Debug::Print(_XT1FreqHz);
////            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        _On = true;
//        for (bool on_=false;; on_=!on_) {
////            __delay_cycles(1000000);
////            _Pin::LED_GREEN_::Write(on_);
////            _Debug::Print("Fired\n");
////            _EventTimer::Schedule(_RTC::Now() + 5*Time::TicksFreq::num);
////            _Scheduler::Wait([] { return _EventTimer::Fired(); });
//            
//            const auto nextTime = _Triggers::EventFront()->time;
//            const auto currTime = _RTC::Now();
//            
//            _Debug::Print("EventFront:");
//            _Debug::PrintHex((uint16_t)_Triggers::EventFront());
//            
//            _Debug::Print("Next:");
//            _Debug::PrintHex(nextTime);
//            
//            _Debug::Print("Curr:");
//            _Debug::PrintHex(currTime);
//            
//            _Debug::Print("Delta:");
//            _Debug::PrintHex(nextTime - currTime);
//            _Debug::Print("");
//            
//            _Scheduler::Sleep(_Scheduler::Ms<1000>);
//        }
        
        
        
//        _On = true;
//        for (bool on_=false;; on_=!on_) {
////            __delay_cycles(1000000);
////            _Pin::LED_GREEN_::Write(on_);
//            _Debug::Print("Fired\n");
//            _EventTimer::Schedule(_RTC::Now() + 5*Time::TicksFreq::num);
//            _Scheduler::Wait([] { return _EventTimer::Fired(); });
//        }
        
//        for (bool on_=false;; on_=!on_) {
//            _Pin::LED_GREEN_::Write(on_);
//            _Scheduler::Sleep(_Scheduler::Ms<1000>);
//        }
        
