toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            _Pin::LED_GREEN_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            if (_Clock::_ClockFaults()) {
//                _Pin::LED_RED_::Write(0);
//            } else {
//                _Pin::LED_GREEN_::Write(0);
//            }
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        for (;;) {
////            _LEDRed_.set(_LEDPriority::Power, !_LEDRed_.get());
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        for (;;) {
////            _LEDRed_.set(_LEDPriority::Power, !_LEDRed_.get());
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        for (;;) {
//            _Debug::Print("accessMode");
//            _Scheduler::Sleep(_Scheduler::Ms<1000>);
//        }
        
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            // Ignore all interaction in host mode
            if (_HostMode::Asserted()) continue;
            
            // Keep the lights on until we're done handling the event
            _Caffeine::Assertion caffeine(true);
            
            switch (ev) {
            case _Button::Event::Press: {
                // Ignore button presses if we're off
                if (!_On) break;
                
                for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
                    _TaskEvent::CaptureStart(*it, _RTC::Now());
                }
                break;
            }
            
            case _Button::Event::Hold:
                _On = !_On;
                _OnSaved = _On;
                _LEDFlash(_On ? _LEDGreen_ : _LEDRed_);
                _Button::WaitForDeassert();
                break;
            }
        }
    }
    
    static void Sleep() {
        // Put ourself to sleep until an interrupt occurs
        
        // Enable/disable SysTick depending on whether we have tasks that are waiting for a deadline to pass.
        // We do this to prevent ourself from waking up unnecessarily, saving power.
        _SysTick = _Scheduler::TickRequired();
        
        // We consider the sleep 'extended' if SysTick isn't needed during the sleep
//        const bool extendedSleep = false;
//        const bool extendedSleep = true;
        const bool extendedSleep = !_SysTick;
        _Clock::Sleep(extendedSleep);
        
        // Unconditionally enable SysTick while we're awake
        _SysTick = true;
    }
    
    static void _LEDFlash(OutputPriority& led) {
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            led.set(_LEDPriority::Power, 0);
            _Scheduler::Delay(_Scheduler::Ms<50>);
            led.set(_LEDPriority::Power, 1);
            _Scheduler::Delay(_Scheduler::Ms<50>);
        }
        led.set(_LEDPriority::Power, std::nullopt);
    }
    
    // _On: controls user-visible on/off behavior
    static inline _Powered::Assertion _On;
    
    // _SysTickEnabled: controls whether the SysTick timer is enabled
    // We disable SysTick when going to sleep if no tasks are waiting for a certain amount of time to pass
    static inline _SysTickEnabled::Assertion _SysTick;
    
    // Task stack
    static constexpr auto& Stack = _TaskMainStack;
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static void _Sleep() {
    _TaskMain::Sleep();
}

// MARK: - Interrupts

[[gnu::interrupt]]
void _ISR_RTC() {
    // Pet the watchdog first
    _Watchdog::Init();
    
    // Let _RTC know that we got an RTC interrupt
    _RTC::ISR(RTCIV);
    
    // Let _EventTimer know we got an RTC interrupt
    const bool wake = _EventTimer::ISRRTC();
    // Wake if the timer fired
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_TIMER0_A1() {
    const bool wake = _EventTimer::ISRTimer(TA0IV);
    
//    _Pin::LED_RED_::Write(1);
//    for (;;) {
//        _Pin::LED_RED_::Write(1);
//        __delay_cycles(1000000);
//        _Pin::LED_RED_::Write(0);
//        __delay_cycles(1000000);
//    }
    
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_TIMER1_A1() {
//    _Pin::LED_GREEN_::Write(!_Pin::LED_GREEN_::Read());
    const bool wake = _SysTick::ISR(TA1IV);
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_PORT2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (iv) {
    
    // Motion
    case _Pin::MOTION_SIGNAL::IVPort2():
        _Motion::ISR();
        // Wake ourself
        _Clock::Wake();
        break;
    
    // I2C (ie VDD_B_3V3_STM)
    case _I2C::Pin::Active::IVPort2():
        _I2C::ISR_Active(iv);
        // Wake ourself
        _Clock::Wake();
        break;
    
    // Button
    case _Button::Pin::IVPort2():
        _Button::ISR();
        // Wake ourself
        _Clock::Wake();
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt]]
void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_ADC() {
    _BatterySampler::ISR(ADCIV);
    // Wake ourself
    _Clock::Wake();
}

[[noreturn]]
[[gnu::naked]] // No function preamble because we always abort, so we don't need to preserve any registers
[[gnu::interrupt]]
void _ISR_UNMI() {
    switch (SYSUNIV) {
    case SYSUNIV_NMIIFG:    Assert(false);
    case SYSUNIV_OFIFG:     Assert(false);
    default:                Assert(false);
    }
}

[[gnu::interrupt]]
void _ISR_SYSNMI() {
    switch (SYSSNIV) {
    case SYSSNIV_VMAIFG:
        Assert(false);
#if DebugEnable
    case SYSSNIV_JMBOUTIFG:
        if (_Debug::ISR()) {
            // Wake ourself if directed
            _Clock::Wake();
        }
        break;
#endif // DebugEnable
    default:
        Assert(false);
    }
}

// MARK: - Main

//extern "C" void Blink() {
//    for (;;) {
//        _Pin::LED_GREEN_::Write(0);
//        for (volatile uint16_t i=0; i<50000; i++);
//        _Pin::LED_GREEN_::Write(1);
//        for (volatile uint16_t i=0; i<50000; i++);
//    }
//}

int main() {
    // If our previous reset wasn't because we explicitly reset ourself (a 'software BOR'),
    // reset ourself now.
    //
    // This ensures that any unexpected reset (such as a watchdog timer timeout) triggers
    // a full BOR, and not a PUC or a POR. We want a full BOR because it resets all our
    // peripherals, unlike a PUC/POR, which don't reset all peripherals (like timers).
    // This will cause us to reset ourself twice upon initial startup, but that's OK.
    //
    // We want to do this here before interrupts are first enabled, and not within
    // _TaskMain, to ensure that we don't have pending resets after a reset (since some
    // IFG flags persist across PUC/POR). We especially don't want our peripherals to
    // receive ISRs before they're initialized.
    //
    // We also want to do this here to prevent a potential crash loop: if an interrupt
    // handler crashed before it clears its IFG flag, and that IFG flag persists across
    // PUC/POR, if we enabled interrupts before checking if this reset was a BOR, then
    // the interrupt would immediately fire again and a crash loop would ensue. (We may
    // have encountered this issue when we had missing entries in our vector table.)
    if (Startup::ResetReason() != SYSRSTIV_DOBOR) {
        _ResetRecord(MSP::Reset::Type::Reset, Startup::ResetReason());
        _BOR();
    }
    
    // Invokes the first task's Run() function (_TaskMain::Run)
    _Scheduler::Run();
}
